Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وكذلك أوحينا إليك قرآنا عربيا لتنذر أم القرى ومن حولها وتنذر يوم الجمع لا ريب فيه فريق في الجنة وفريق في السعير
en: And thus We have revealed to you (O Muhammad صلى الله عليه و سلم) a Qur'an in Arabic that you may warn the Mother of the Towns (Makkah) and all around it, and warn (them) of the Day of Assembling of which there is no doubt: when a party will be in Paradise (those who believed in Allah and followed what Allah's Messenger صلى الله عليه و سلم brought them) and a party in the blazing Fire (Hell) (those who disbelieved in Allah and followed not what Allah's Messenger صلى الله عليه و سلم brought them).

source: ولو شاء الله لجعلهم أمة واحدة ولكن يدخل من يشاء في رحمته والظالمون ما لهم من ولي ولا نصير
en: And if Allah had willed, He could have made them one nation, but He admits whom He wills to His Mercy. And the Zalimun (polytheists and wrong-doers) will have neither a Wali (protector or guardian) nor a helper.

source: أم اتخذوا من دونه أولياء فالله هو الولي وهو يحيي الموتى وهو على كل شيء قدير
en: Or have they taken (for worship) Auliya' (guardians, supporters, helpers, protectors, lords, gods) besides Him? But Allah - He Alone is the Wali (Lord, God, Protector). And it is He Who gives life to the dead, and He is Able to do all things.

source: وما اختلفتم فيه من شيء فحكمه إلى الله ذلكم الله ربي عليه توكلت وإليه أنيب
en: And in whatsoever you differ, the decision thereof is with Allah (He is the ruling Judge). (And say O Muhammad صلى الله عليه و سلم to these polytheists:) Such is Allah, my Lord in Whom I put my trust, and to Him I turn (in all of my affairs and) in repentance.

source: فاطر السماوات والأرض جعل لكم من أنفسكم أزواجا ومن الأنعام أزواجا يذرؤكم فيه ليس كمثله شيء وهو السميع البصير
en: The Creator of the heavens and the earth. He has made for you mates from yourselves, and for the cattle (also) mates. By this means He creates you (in the wombs). There is nothing like Him; and He is the All-Hearer, the All-Seer.

source: له مقاليد السماوات والأرض يبسط الرزق لمن يشاء ويقدر إنه بكل شيء عليم
en: To Him belong the keys of the heavens and the earth. He enlarges provision for whom He wills, and straitens (it for whom He wills). Verily He is the All-Knower of everything.

source: شرع لكم من الدين ما وصى به نوحا والذي أوحينا إليك وما وصينا به إبراهيم وموسى وعيسى أن أقيموا الدين ولا تتفرقوا فيه كبر على المشركين ما تدعوهم إليه الله يجتبي إليه من يشاء ويهدي إليه من ينيب
en: He (Allah) has ordained for you the same religion (Islamic Monotheism) which He ordained for Nuh (Noah), and that which We have revealed to you (O Muhammad صلى الله عليه و سلم), and that which We ordained for Ibrahim (Abraham), Musa (Moses) and 'Îsa (Jesus) saying you should establish religion (i.e. to do what it orders you to do practically), and make no divisions in it (religion) (i.e. various sects in religion). Intolerable for the Mushrikun, is that (Islamic Monotheism) to which you (O Muhammad صلى الله عليه و سلم) call them. Allah chooses for Himself whom He wills, and guides unto Himself who turns to Him in repentance and in obedience.

source: وما تفرقوا إلا من بعد ما جاءهم العلم بغيا بينهم ولولا كلمة سبقت من ربك إلى أجل مسمى لقضي بينهم وإن الذين أورثوا الكتاب من بعدهم لفي شك منه مريب
en: And they divided not till after knowledge had come to them, through (selfish) transgression between themselves. And had it not been for a Word that went forth before from your Lord for an appointed term, the matter would have been settled between them. And verily, those who were made to inherit the Scripture [i.e. the Taurah (Torah) and the Injeel (Gospel)] after them (i.e. Jews and Christians) are in grave doubt concerning it (i.e. Allah's true religion - Islam or the Qur'an).

source: فلذلك فادع واستقم كما أمرت ولا تتبع أهواءهم وقل آمنت بما أنزل الله من كتاب وأمرت لأعدل بينكم الله ربنا وربكم لنا أعمالنا ولكم أعمالكم لا حجة بيننا وبينكم الله يجمع بيننا وإليه المصير
en: So unto this (religion of Islam alone and this Qur'an) then invite (people) (O Muhammad صلى الله عليه و سلم), and stand firm [on Islamic Monotheism by performing all that is ordained by Allah (good deeds), and by abstaining from all that is forbidden by Allah (sins and evil deeds)], as you are commanded, and follow not their desires but say: "I believe in whatsoever Allah has sent down of the Book [all the holy Books, - this Qur'an and the Books of the old from the Taurat (Torah), or the Injeel (Gospel) or the Pages of Ibrahim (Abraham)] and I am commanded to do justice among you. Allah is our Lord and your Lord. For us our deeds and for you your deeds. There is no dispute between us and you. Allah will assemble us (all), and to Him is the final return."

source: والذين يحاجون في الله من بعد ما استجيب له حجتهم داحضة عند ربهم وعليهم غضب ولهم عذاب شديد
en: And those who dispute concerning Allah (His religion of Islamic Monotheism with which Muhammad صلى الله عليه و سلم has been sent), after it has been accepted (by the people), of no use is their dispute before their Lord and on them is wrath, and for them will be a severe torment.

source: الله الذي أنزل الكتاب بالحق والميزان وما يدريك لعل الساعة قريب
en: It is Allah Who has sent down the Book (the Qur'an) in truth, and the Balance (i.e. to act justly). And what can make you know that perhaps the Hour is close at hand?

source: يستعجل بها الذين لا يؤمنون بها والذين آمنوا مشفقون منها ويعلمون أنها الحق ألا إن الذين يمارون في الساعة لفي ضلال بعيد
en: Those who believe not therein seek to hasten it, while those who believe are fearful of it, and know that it is the very truth. Verily, those who dispute concerning the Hour are certainly in error far away.

source: الله لطيف بعباده يرزق من يشاء وهو القوي العزيز
en: Allah is very Gracious and Kind to His slaves. He gives provisions to whom He wills. And He is the All-Strong, the All-Mighty.

source: من كان يريد حرث الآخرة نزد له في حرثه ومن كان يريد حرث الدنيا نؤته منها وما له في الآخرة من نصيب
en: Whosoever desires (by his deeds) the reward of the Hereafter, We give him increase in his reward, and whosoever desires the reward of this world (by his deeds), We give him thereof (what is decreed for him), and he has no portion in the Hereafter.

source: أم لهم شركاء شرعوا لهم من الدين ما لم يأذن به الله ولولا كلمة الفصل لقضي بينهم وإن الظالمين لهم عذاب أليم
en: Or have they partners with Allah (false gods) who have instituted for them a religion which Allah has not ordained? And had it not been for a decisive Word (gone forth already), the matter would have been judged between them. And verily, for the Zalimun (polytheists and wrong-doers) there is a painful torment.

source: ترى الظالمين مشفقين مما كسبوا وهو واقع بهم والذين آمنوا وعملوا الصالحات في روضات الجنات لهم ما يشاءون عند ربهم ذلك هو الفضل الكبير
en: You will see (on the Day of Resurrection), the Zalimun (polytheists and wrong-doers) fearful of that which they have earned, and it (Allah's Torment) will surely befall them. But those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous deeds (will be) in the flowering meadows of the Gardens (Paradise). They shall have whatsoever they desire with their Lord. That is the supreme Grace, (Paradise).

source: ذلك الذي يبشر الله عباده الذين آمنوا وعملوا الصالحات قل لا أسألكم عليه أجرا إلا المودة في القربى ومن يقترف حسنة نزد له فيها حسنا إن الله غفور شكور
en: That is (the Paradise) whereof Allah gives glad tidings to His slaves who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds. Say (O Muhammad صلى الله عليه و سلم): "No reward do I ask of you for this except to be kind to me for my kinship with you." And whoever earns a good righteous deed, We shall give him an increase of good in respect thereof. Verily, Allah is Oft-Forgiving, Most Ready to appreciate (the deeds of those who are obedient to Him).

source: أم يقولون افترى على الله كذبا فإن يشإ الله يختم على قلبك ويمح الله الباطل ويحق الحق بكلماته إنه عليم بذات الصدور
en: Or say they: "He has invented a lie against Allah?" If Allah willed, He could have sealed up your heart (so that you forget all that you know of the Qur'an). And Allah wipes out falsehood, and establishes the truth (Islam) by His Word (this Qur'an). Verily, He knows well what (secrets) are in the breasts (of mankind).

source: وهو الذي يقبل التوبة عن عباده ويعفو عن السيئات ويعلم ما تفعلون
en: And He it is Who accepts repentance from His slaves, and forgives sins, and He knows what you do.

source: ويستجيب الذين آمنوا وعملوا الصالحات ويزيدهم من فضله والكافرون لهم عذاب شديد
en: And He answers (the invocation of) those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, and gives them increase of His Bounty. And as for the disbelievers, theirs will be a severe torment.

source: ولو بسط الله الرزق لعباده لبغوا في الأرض ولكن ينزل بقدر ما يشاء إنه بعباده خبير بصير
en: And if Allah were to enlarge the provision for His slaves, they would surely rebel in the earth, but He sends down by measure as He wills. Verily! He is, in respect of His slaves, the Well-Aware, the All-Seer (of things that benefit them).

source: وهو الذي ينزل الغيث من بعد ما قنطوا وينشر رحمته وهو الولي الحميد
en: And He it is Who sends down the rain after they have despaired, and spreads His Mercy. And He is the Wali (Helper, Supporter, Protector, Lord), Worthy of all Praise.

source: ومن آياته خلق السماوات والأرض وما بث فيهما من دابة وهو على جمعهم إذا يشاء قدير
en: And among His Ayat (proofs, evidence, lessons, signs, etc.) is the creation of the heavens and the earth, and whatever moving (living) creatures He has dispersed in them both. And He is All-Potent over their assembling (i.e. resurrecting them on the Day of Resurrection after their death, and dispersion of their bodies) whenever He wills.

source: وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير
en: And whatever of misfortune befalls you, it is because of what your hands have earned. And He pardons much. (See the Qur'an Verse 35:45).

source: وما أنتم بمعجزين في الأرض وما لكم من دون الله من ولي ولا نصير
en: And you cannot escape from Allah (i.e. His punishment) in the earth, and besides Allah you have neither any Wali (guardian or a protector, helper) nor any helper.

source: ومن آياته الجوار في البحر كالأعلام
en: And among His Signs are the ships in the sea like mountains.

source: إن يشأ يسكن الريح فيظللن رواكد على ظهره إن في ذلك لآيات لكل صبار شكور
en: If He wills, He causes the wind to cease, then they would become motionless on the back (of the sea). Verily, in this are signs for everyone patient and grateful.

source: أو يوبقهن بما كسبوا ويعف عن كثير
en: Or He may destroy them (by shipwreck) because of that which their (people) have earned. And He pardons much.

source: ويعلم الذين يجادلون في آياتنا ما لهم من محيص
en: And those who dispute (polytheists with Our Messenger Muhammad صلى الله عليه و سلم) as regards Our Ayat (proofs, signs, verses, etc. of Islamic Monotheism) may know that there is no place of refuge for them (from Allah's punishment) [Tafsir At-Tabari].

source: فما أوتيتم من شيء فمتاع الحياة الدنيا وما عند الله خير وأبقى للذين آمنوا وعلى ربهم يتوكلون
en: So whatever you have been given is but (a passing) enjoyment for this worldly life, but that which is with Allah (Paradise) is better and more lasting for those who believe (in the Oneness of Allah - Islamic Monotheism) and put their trust in their Lord (concerning all of their affairs).

source: والذين يجتنبون كبائر الإثم والفواحش وإذا ما غضبوا هم يغفرون
en: And those who avoid the greater sins, and Al-Fawahish (illegal sexual intercourse), and when they are angry, forgive.

source: والذين استجابوا لربهم وأقاموا الصلاة وأمرهم شورى بينهم ومما رزقناهم ينفقون
en: And those who answer the Call of their Lord [i.e. to believe that He is the only One Lord (Allah), and to worship none but Him Alone], and perform As-Salat (Iqamat-as-Salat), and who (conduct) their affairs by mutual consultation, and who spend of what We have bestowed on them.

source: والذين إذا أصابهم البغي هم ينتصرون
en: And those who, when an oppressive wrong is done to them, take revenge.

source: وجزاء سيئة سيئة مثلها فمن عفا وأصلح فأجره على الله إنه لا يحب الظالمين
en: The recompense for an evil is an evil like thereof; but whoever forgives and makes reconciliation, his reward is with Allah. Verily, He likes not the Zalimun (oppressors, polytheists, and wrong-doers).

source: ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل
en: And indeed whosoever takes revenge after he has suffered wrong, for such there is no way (of blame) against them.

source: إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق أولئك لهم عذاب أليم
en: The way (of blame) is only against those who oppress men and rebel in the earth without justification; for such there will be a painful torment.

source: ولمن صبر وغفر إن ذلك لمن عزم الأمور
en: And verily, whosoever shows patience and forgives, that would truly be from the things recommended by Allah.

source: ومن يضلل الله فما له من ولي من بعده وترى الظالمين لما رأوا العذاب يقولون هل إلى مرد من سبيل
en: And whomsoever Allah sends astray, for him there is no Wali (protector, helper, guardian) after Him. And you will see the Zalimun (polytheists, wrong-doers, oppressors): when they behold the torment, they will say: "Is there any way of return (to the world)?"

source: وتراهم يعرضون عليها خاشعين من الذل ينظرون من طرف خفي وقال الذين آمنوا إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا إن الظالمين في عذاب مقيم
en: And you will see them brought forward to it (Hell) made humble by disgrace, (and) looking with stealthy glance. And those who believe will say: "Verily, the losers are they who lose themselves and their families on the Day of Resurrection. Verily, the Zalimun [i.e. Al-Kafirun (disbelievers in Allah, in His Oneness and in His Messenger صلى الله عليه و سلم, polytheists, wrong-doers)] will be in a lasting torment. (Tafsir At-Tabari).

source: وما كان لهم من أولياء ينصرونهم من دون الله ومن يضلل الله فما له من سبيل
en: And they will have no Auliya' (protectors, helpers, guardians, lords) to help them other than Allah. And he whom Allah sends astray, for him there is no way.

source: استجيبوا لربكم من قبل أن يأتي يوم لا مرد له من الله ما لكم من ملجإ يومئذ وما لكم من نكير
en: Answer the Call of your Lord (i.e. accept the Islamic Monotheism, O mankind, and jinn) before there comes from Allah a Day which cannot be averted (i.e. the Day of Resurrection). You will have no refuge on that Day nor there will be for you any denying (of your crimes as they are all recorded in the Book of your deeds).

source: فإن أعرضوا فما أرسلناك عليهم حفيظا إن عليك إلا البلاغ وإنا إذا أذقنا الإنسان منا رحمة فرح بها وإن تصبهم سيئة بما قدمت أيديهم فإن الإنسان كفور
en: But if they turn away (O Muhammad صلى الله عليه و سلم from the Islamic Monotheism, which you have brought to them). We have not sent you (O Muhammad صلى الله عليه و سلم) as a Hafiz (watcher, protector) over them (i.e. to take care of their deeds and to recompense them). Your duty is to convey (the Message). And verily, when We cause man to taste of Mercy from Us, he rejoices thereat; but when some ill befalls them because of the deeds which their hands have sent forth, then verily, man (becomes) ingrate!

source: لله ملك السماوات والأرض يخلق ما يشاء يهب لمن يشاء إناثا ويهب لمن يشاء الذكور
en: To Allah belongs the kingdom of the heavens and the earth. He creates what He wills. He bestows female (offspring) upon whom He wills, and bestows male (offspring) upon whom He wills.

source: أو يزوجهم ذكرانا وإناثا ويجعل من يشاء عقيما إنه عليم قدير
en: Or He bestows both males and females, and He renders barren whom He wills. Verily, He is the All-Knower and is Able to do all things.

source: وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب أو يرسل رسولا فيوحي بإذنه ما يشاء إنه علي حكيم
en: It is not given to any human being that Allah should speak to him unless (it be) by Revelation, or from behind a veil, or (that) He sends a Messenger to reveal what He wills by His Leave. Verily, He is Most High, Most Wise.

source: وكذلك أوحينا إليك روحا من أمرنا ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا وإنك لتهدي إلى صراط مستقيم
en: And thus We have sent to you (O Muhammad صلى الله عليه و سلم) Ruh (a Revelation, and a Mercy) of Our Command. You knew not what is the Book, nor what is Faith? But We have made it (this Qur'an) a light wherewith We guide whosoever of Our slaves We will. And verily, you (O Muhammad صلى الله عليه و سلم) are indeed guiding (mankind) to the Straight Path (i.e. Allah's Religion of Islamic Monotheism).

source: صراط الله الذي له ما في السماوات وما في الأرض ألا إلى الله تصير الأمور
en: The Path of Allah to Whom belongs all that is in the heavens and all that is in the earth. Verily, all matters at the end go to Allah (for decision).

source: والكتاب المبين
en: By the manifest Book (i.e. this Qur'an that makes things clear).

source: إنا جعلناه قرآنا عربيا لعلكم تعقلون
en: Verily, We have made it a Qur'an in Arabic that you may be able to understand (its meanings and its admonitions).

source: وإنه في أم الكتاب لدينا لعلي حكيم
en: And verily, it (this Qur'an) is in the Mother of the Book (i.e. Al-Lauh Al-Mahfuz), with Us, indeed exalted, full of wisdom.

source: أفنضرب عنكم الذكر صفحا أن كنتم قوما مسرفين
en: Shall We then (warn you not and) take away the Reminder (this Qur'an) from you, because you are a people Musrifun.

source: وكم أرسلنا من نبي في الأولين
en: And how many a Prophet have We sent amongst the men of old.

source: وما يأتيهم من نبي إلا كانوا به يستهزئون
en: And never came there a Prophet to them but they used to mock at him.

source: فأهلكنا أشد منهم بطشا ومضى مثل الأولين
en: Then We destroyed men stronger (in power) than these - and the example of the ancients has passed away (before them).

source: ولئن سألتهم من خلق السماوات والأرض ليقولن خلقهن العزيز العليم
en: And indeed if you ask them, "Who has created the heavens and the earth?" They will surely say: "The All-Mighty, the All-Knower created them."

source: الذي جعل لكم الأرض مهدا وجعل لكم فيها سبلا لعلكم تهتدون
en: Who has made for you the earth like a bed, and has made for you roads therein, in order that you may find your way.

source: والذي نزل من السماء ماء بقدر فأنشرنا به بلدة ميتا كذلك تخرجون
en: And Who sends down water (rain) from the sky in due measure, then We revive a dead land therewith, and even so you will be brought forth (from the graves).

source: والذي خلق الأزواج كلها وجعل لكم من الفلك والأنعام ما تركبون
en: And Who has created all the pairs and has appointed for you ships and cattle on which you ride:

source: لتستووا على ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين
en: In order that you may mount on their backs, and then may remember the Favour of your Lord when you mount thereon, and say: "Glory to Him Who has subjected this to us, and we could never have it (by our efforts).

source: وإنا إلى ربنا لمنقلبون
en: And verily, to Our Lord we indeed are to return!"

source: وجعلوا له من عباده جزءا إن الإنسان لكفور مبين
en: Yet, they assign to some of His slaves a share with Him (by pretending that He has children, and considering them as equals or co-partners in worship with Him). Verily, man is indeed a manifest ingrate!

source: أم اتخذ مما يخلق بنات وأصفاكم بالبنين
en: Or has He taken daughters out of what He has created, and He has selected for you sons?

source: وإذا بشر أحدهم بما ضرب للرحمن مثلا ظل وجهه مسودا وهو كظيم
en: And if one of them is informed of the news of (the birth of a girl) that which he sets forth as a parable to the Most Gracious (Allah), his face becomes dark, and he is filled with grief!

source: أومن ينشأ في الحلية وهو في الخصام غير مبين
en: (Like they then for Allah) a creature who is brought up in adornments (wearing silk and gold ornaments, i.e. women), and who in dispute cannot make herself clear?

source: وجعلوا الملائكة الذين هم عباد الرحمن إناثا أشهدوا خلقهم ستكتب شهادتهم ويسألون
en: And they make the angels who themselves are slaves of the Most Gracious (Allah) females. Did they witness their creation? Their testimony will be recorded, and they will be questioned!

source: وقالوا لو شاء الرحمن ما عبدناهم ما لهم بذلك من علم إن هم إلا يخرصون
en: And they said: "If it had been the Will of the Most Gracious (Allah), we should not have worshipped them (false deities)." They have no knowledge whatsoever of that. They do nothing but lie!

source: أم آتيناهم كتابا من قبله فهم به مستمسكون
en: Or have We given them any Book before this (the Qur'an) to which they are holding fast?

source: بل قالوا إنا وجدنا آباءنا على أمة وإنا على آثارهم مهتدون
en: Nay! They say: "We found our fathers following a certain way and religion, and we guide ourselves by their footsteps."

source: وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون
en: And similarly, We sent not a warner before you (O Muhammad صلى الله عليه و سلم) to any town (people) but the luxurious ones among them said: "We found our fathers following a certain way and religion, and we will indeed follow their footsteps."

source: قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون
en: (The warner) said: "Even if I bring you better guidance than that which you found your fathers following?" They said: "Verily, we disbelieve in that with which you have been sent."

source: فانتقمنا منهم فانظر كيف كان عاقبة المكذبين
en: So We took revenge on them, then see what was the end of those who denied (Islamic Monotheism).

source: وإذ قال إبراهيم لأبيه وقومه إنني براء مما تعبدون
en: And (remember) when Ibrahim (Abraham) said to his father and his people: "Verily, I am innocent of what you worship,

source: إلا الذي فطرني فإنه سيهدين
en: "Except Him (i.e. I worship none but Allah Alone) Who did create me; and verily He will guide me."

source: وجعلها كلمة باقية في عقبه لعلهم يرجعون
en: And he made it [i.e. La ilaha illallah (none has the right to be worshipped but Allah Alone)] a Word lasting among his offspring, (True Monotheism), that they may turn back (i.e. to repent to Allah or receive admonition).

source: بل متعت هؤلاء وآباءهم حتى جاءهم الحق ورسول مبين
en: Nay, but I gave (the good things of this life) to these (polytheists) and their fathers to enjoy, till there came to them the truth (the Qur'an), and a Messenger (Muhammad صلى الله عليه و سلم) making things clear.

source: ولما جاءهم الحق قالوا هذا سحر وإنا به كافرون
en: And when the truth (this Qur'an) came to them, they (the disbelievers in this Qur'an) said: "This is magic, and we disbelieve therein."

source: وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم
en: And they say: "Why is not this Qur'an sent down to some great man of the two towns (Makkah and Ta'if)?"

source: أهم يقسمون رحمت ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ليتخذ بعضهم بعضا سخريا ورحمت ربك خير مما يجمعون
en: Is it they who would portion out the Mercy of your Lord? It is We Who portion out between them their livelihood in this world, and We raised some of them above others in ranks, so that some may employ others in their work. But the Mercy (Paradise) of your Lord (O Muhammad صلى الله عليه و سلم) is better than the (wealth of this world) which they amass.

source: ولولا أن يكون الناس أمة واحدة لجعلنا لمن يكفر بالرحمن لبيوتهم سقفا من فضة ومعارج عليها يظهرون
en: And were it not that mankind would have become of one community (all disbelievers, desiring worldly life only), We would have provided for those who disbelieve in the Most Gracious (Allah), silver roofs for their houses, and elevators whereby they ascend,

source: ولبيوتهم أبوابا وسررا عليها يتكئون
en: And for their houses, doors (of silver), and thrones (of silver) on which they could recline,
